; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_2 ?v4 - type_2 ?v7 - type_3)
 	      (pred_4 ?v1 - object ?v7 - type_3)
	      (pred_3 ?v4 - type_2 ?v5 - type_1)
	      (pred_1 ?v4 - type_2 ?v1 - object ?v5 - type_1))

   (:action op_3
       :parameters  (?v4 - type_2 ?v8 ?v3 - type_3)
       :precondition (and  (pred_2 ?v4 ?v8))
       :effect (and  (pred_2 ?v4 ?v3)
		     (not (pred_2 ?v4 ?v8))))

   (:action op_2
       :parameters (?v4 - type_2 ?v6 - object ?v2 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_4 ?v6 ?v2) (pred_2 ?v4 ?v2) (pred_3 ?v4 ?v5))
       :effect (and (pred_1 ?v4 ?v6 ?v5)
		    (not (pred_4 ?v6 ?v2)) 
		    (not (pred_3 ?v4 ?v5))))

   (:action op_1
       :parameters (?v4 - type_2 ?v6 - object ?v2 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_1 ?v4 ?v6 ?v5) (pred_2 ?v4 ?v2))
       :effect (and (pred_4 ?v6 ?v2)
		    (pred_3 ?v4 ?v5)
		    (not (pred_1 ?v4 ?v6 ?v5)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_09 obj_07 - type_2
obj_06 obj_04 obj_01 obj_03 - type_1
obj_08 obj_11 obj_10 - type_3
obj_05 obj_12 obj_02 - object)
(:init
(pred_2 obj_09 obj_11)
(pred_3 obj_09 obj_06)
(pred_3 obj_09 obj_04)
(pred_2 obj_07 obj_08)
(pred_3 obj_07 obj_01)
(pred_3 obj_07 obj_03)
(pred_4 obj_05 obj_10)
(pred_4 obj_12 obj_10)
(pred_4 obj_02 obj_11)
)
(:goal
(and
(pred_4 obj_05 obj_08)
(pred_4 obj_12 obj_10)
(pred_4 obj_02 obj_10)
)
)

(:constraints
  (always (not (pred_2 obj_09 obj_10)))
)
)

; plan
1. (op_2 obj_09 obj_02 obj_11 obj_04)
   deleted: (pred_4 obj_02 obj_11) (pred_3 obj_09 obj_04)
   added: (pred_1 obj_09 obj_02 obj_04)
   goals met: 1 of 3
2. (op_3 obj_07 obj_08 obj_10)
   deleted: (pred_2 obj_07 obj_08)
   added: (pred_2 obj_07 obj_10)
   goals met: 1 of 3
3. (op_2 obj_07 obj_05 obj_10 obj_03)
   deleted: (pred_4 obj_05 obj_10) (pred_3 obj_07 obj_03)
   added: (pred_1 obj_07 obj_05 obj_03)
   goals met: 1 of 3
4. (op_3 obj_09 obj_11 obj_08)
   deleted: (pred_2 obj_09 obj_11)
   added: (pred_2 obj_09 obj_08)
   goals met: 1 of 3
5. (op_3 obj_07 obj_10 obj_08)
   deleted: (pred_2 obj_07 obj_10)
   added: (pred_2 obj_07 obj_08)
   goals met: 1 of 3
6. (op_1 obj_09 obj_02 obj_08 obj_04)
   deleted: (pred_1 obj_09 obj_02 obj_04)
   added: (pred_4 obj_02 obj_08) (pred_3 obj_09 obj_04)
   goals met: 1 of 3
7. (op_1 obj_07 obj_05 obj_08 obj_03)
   deleted: (pred_1 obj_07 obj_05 obj_03)
   added: (pred_4 obj_05 obj_08) (pred_3 obj_07 obj_03)
   goals met: 2 of 3
8. (op_2 obj_07 obj_02 obj_08 obj_03)
   deleted: (pred_4 obj_02 obj_08) (pred_3 obj_07 obj_03)
   added: (pred_1 obj_07 obj_02 obj_03)
   goals met: 2 of 3
9. (op_3 obj_07 obj_08 obj_10)
   deleted: (pred_2 obj_07 obj_08)
   added: (pred_2 obj_07 obj_10)
   goals met: 2 of 3
10. (op_1 obj_07 obj_02 obj_10 obj_03)
   deleted: (pred_1 obj_07 obj_02 obj_03)
   added: (pred_4 obj_02 obj_10) (pred_3 obj_07 obj_03)
   goals met: 3 of 3
